apache/nuttx/arch/arm/src/tlsr82/tlsr82_gpio.c
/****************************************************************************
 * arch/arm/src/tlsr82/tlsr82_gpio.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <arch/irq.h>
#include <arch/tlsr82/chip.h>

#include "tlsr82_gpio.h"
#include "tlsr82_analog.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define GPIO_ENABLE             1
#define GPIO_DISABLE            0
#define CONFIG_GPIO_IRQ_MAX_NUM 5

/****************************************************************************
 * Private Types
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
struct tlsr82_gpio_irq_cb
{
  xcpt_t        callback;
  void         *arg;
  gpio_cfg_t    cfg;
};
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
struct tlsr82_gpio_irq_cb gpio_irq_cbs[CONFIG_GPIO_IRQ_MAX_NUM];
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_DUMPREGS
static void tlsr82_gpio_dumpregs(const char *msg);
#else
#  define tlsr82_gpio_dumpregs(msg)
#endif

static void tlsr82_gpio_ds_ctrl(gpio_cfg_t cfg, uint8_t ds);
static void tlsr82_gpio_pol_ctrl(gpio_cfg_t cfg, uint8_t pol);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_DUMPREGS
static void tlsr82_gpio_dumpregs(const char *msg)
{
  int i = 0;
  gpioinfo("%s\n", msg);
  for (i = 0; i < 5; i++)
    {
      gpioinfo("Group %d Gpio Register:\n", i);
      gpioinfo("  ACT=0x%02x\n", GPIO_SETTING_ACT_REG(i));
      gpioinfo("  IN =0x%02x\n", GPIO_SETTING_IN_REG(i));

      if (i != 3)
        {
          gpioinfo("  IE =0x%02x\n", GPIO_SETTING_IE_REG(i));
        }
      else
        {
          gpioinfo("  IE =0x%02x\n", tlsr82_analog_read(ANALOG_PC_IE_ADDR));
        }

      gpioinfo("  OEN=0x%02x\n", GPIO_SETTING_OEN_REG(i));
      gpioinfo("  OUT=0x%02x\n", GPIO_SETTING_OUT_REG(i));
      gpioinfo("  POL=0x%02x\n", GPIO_SETTING_POL_REG(i));

      if (i != 3)
        {
          gpioinfo("  DS =0x%02x\n", GPIO_SETTING_DS_REG(i));
        }
      else
        {
          gpioinfo("  DS =0x%02x\n", tlsr82_analog_read(ANALOG_PC_DS_ADDR));
        }
    }

  gpioinfo("Interrupt Register:\n");
  for (i = 0; i < 5; i++)
    {
      gpioinfo("  IRQ NORMAL %d: 0x%02x\n", i, GPIO_IRQ_NORMAL_REG(i));
    }

  gpioinfo("  IRQ NORMAL ALL 0x%02x\n", GPIO_IRQ_NORMAL_ALL_REG);
  gpioinfo("  IRQ RISC: 0x%02x\n", GPIO_IRQ_RISC_EN_REG);
  gpioinfo("  IRQ MASK: 0x%08lx\n", IRQ_MASK_REG);

  for (i = 0; i < CONFIG_GPIO_IRQ_MAX_NUM; i++)
    {
      gpioinfo("gpio_irq_cbs[%d]->arg     : 0x%08x\n",
               i, gpio_irq_cbs[i].arg);
      gpioinfo("gpio_irq_cbs[%d]->callback: 0x%08x\n",
               i, gpio_irq_cbs[i].callback);
      gpioinfo("gpio_irq_cbs[%d]->cfg     : 0x%08x\n",
               i, gpio_irq_cbs[i].cfg);
    }
}
#endif

/****************************************************************************
 * Name: tlsr82_gpio_ds_ctrl
 *
 * Description:
 *   Configure the gpio drive strength be high/low.
 *
 * Input Parameters:
 *   gpio_cfg_t - GPIO config information
 *   ds         - 1 : high drive strength
 *                0 : low drive strength
 *
 * Returned Value:
 *   void
 *
 ****************************************************************************/

static void tlsr82_gpio_ds_ctrl(gpio_cfg_t cfg, uint8_t ds)
{
  uint32_t group;
  uint32_t pin;
  uint32_t bit;

  DEBUGASSERT(GPIO_VALID(cfg));

  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);
  bit     = 1 << pin;

  if (group == GPIO_VAL(GROUP, C))
    {
      if (ds)
        {
          tlsr82_analog_write(ANALOG_PC_DS_ADDR,
                              tlsr82_analog_read(ANALOG_PC_DS_ADDR) |
                              bit);
        }
      else
        {
          tlsr82_analog_write(ANALOG_PC_DS_ADDR,
                              tlsr82_analog_read(ANALOG_PC_DS_ADDR) &
                              (~bit));
        }
    }
  else
    {
      if (ds)
        {
          BM_SET(GPIO_SETTING_DS_REG(group), bit);
        }
      else
        {
          BM_CLR(GPIO_SETTING_DS_REG(group), bit);
        }
    }
}

/****************************************************************************
 * Name: tlsr82_gpio_pol_ctrl
 *
 * Description:
 *   Configure the gpio interrupt polarity (interrupt trigger edge).
 *
 * Input Parameters:
 *   gpio_cfg_t - GPIO config information
 *   pol        - 0 : rising edge trigger
 *                1 : falling edge trigger
 *
 * Returned Value:
 *   void
 *
 ****************************************************************************/

static void tlsr82_gpio_pol_ctrl(gpio_cfg_t cfg, uint8_t pol)
{
  uint32_t group;
  uint32_t pin;

  DEBUGASSERT(GPIO_VALID(cfg));

