apache/nuttx/arch/arm/src/tlsr82/tlsr82_gpio.c
  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);

  if (pol)
    {
      BM_SET(GPIO_SETTING_POL_REG(group), 1 << pin);
    }
  else
    {
      BM_CLR(GPIO_SETTING_POL_REG(group), 1 << pin);
    }
}

/****************************************************************************
 * Name: tlsr82_gpio_irq
 *
 * Description:
 *   GPIO interrupt handler.
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
static int tlsr82_gpio_irq(int irq, void *context, void *arg)
{
  int i;
  void *arg_cb;
  xcpt_t callback;
  int ret = OK;

  gpioinfo("Gpio irq entry!\n");

  /* Clear the GPIO interrupt status */

  BM_SET(IRQ_SRC_REG, 1 << NR_GPIO_IRQ);

  /* Dispatch pending interrupts in the lower GPIO status register */

  for (i = 0; i < CONFIG_GPIO_IRQ_MAX_NUM; ++i)
    {
      if (gpio_irq_cbs[i].callback != NULL &&
          GPIO_IS(IRQ, NORMAL, gpio_irq_cbs[i].cfg))
        {
          arg_cb   = gpio_irq_cbs[i].arg;
          callback = gpio_irq_cbs[i].callback;
          ret = callback(irq, context, arg_cb);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: tlsr82_gpio_risc1_irq
 *
 * Description:
 *   GPIO interrupt handler.
 *
 ****************************************************************************/

static int tlsr82_gpio_risc0_irq(int irq, void *context, void *arg)
{
  int i;
  void *arg_cb;
  xcpt_t callback;
  int ret = OK;

  gpioinfo("Gpio risc0 irq entry!\n");

  /* Clear the GPIO interrupt status */

  BM_SET(IRQ_SRC_REG, 1 << NR_GPIO_RISC0_IRQ);

  /* Dispatch pending interrupts in the lower GPIO status register */

  for (i = 0; i < CONFIG_GPIO_IRQ_MAX_NUM; ++i)
    {
      if (gpio_irq_cbs[i].callback != NULL &&
          GPIO_IS(IRQ, RISC0, gpio_irq_cbs[i].cfg))
        {
          arg_cb   = gpio_irq_cbs[i].arg;
          callback = gpio_irq_cbs[i].callback;
          ret = callback(irq, context, arg_cb);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: tlsr82_gpio_risc1_irq
 *
 * Description:
 *   GPIO interrupt handler.
 *
 ****************************************************************************/

static int tlsr82_gpio_risc1_irq(int irq, void *context, void *arg)
{
  int i;
  void *arg_cb;
  xcpt_t callback;
  int ret = OK;

  gpioinfo("Gpio risc1 irq entry!\n");

  /* Clear the GPIO interrupt status */

  BM_SET(IRQ_SRC_REG, 1 << NR_GPIO_RISC1_IRQ);

  /* Dispatch pending interrupts in the lower GPIO status register */

  for (i = 0; i < CONFIG_GPIO_IRQ_MAX_NUM; ++i)
    {
      if (gpio_irq_cbs[i].callback != NULL &&
          GPIO_IS(IRQ, RISC1, gpio_irq_cbs[i].cfg))
        {
          arg_cb   = gpio_irq_cbs[i].arg;
          callback = gpio_irq_cbs[i].callback;
          ret = callback(irq, context, arg_cb);
        }
    }

  return ret;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tlsr82_gpio_as_gpio
 *
 * Description:
 *   Config the gpio as a gpio or mux function
 *
 * Input Parameters:
 *   gpio_cfg_t - GPIO config information
 *   enable     - true : enable gpio as gpio
 *                false: enable gpio as mux function
 *
 * Returned Value:
 *   void
 *
 ****************************************************************************/

void tlsr82_gpio_as_gpio(gpio_cfg_t cfg, bool enable)
{
  uint32_t group;
  uint32_t pin;

  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);

  if (enable)
    {
      BM_SET(GPIO_SETTING_ACT_REG(group), BIT(pin));
    }
  else
    {
      BM_CLR(GPIO_SETTING_ACT_REG(group), BIT(pin));
    }
}

/****************************************************************************
 * Name: tlsr82_gpio_input_ctrl
 *
 * Description:
 *   Enable/Disable the gpio input function.
 *
 * Input Parameters:
 *   gpio_cfg_t - GPIO config information
 *   enable     - true : enable gpio input function
 *                false: disable gpio input function
 *
 * Returned Value:
 *   void
 *
 ****************************************************************************/

void tlsr82_gpio_input_ctrl(gpio_cfg_t cfg, bool enable)
{
  uint32_t group;
  uint32_t pin;
  uint32_t bit;

  DEBUGASSERT(GPIO_VALID(cfg));

  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);
  bit     = 1 << pin;

  if (group == GPIO_VAL(GROUP, C))
    {
      if (enable)
        {
          tlsr82_analog_write(ANALOG_PC_IE_ADDR,
                              tlsr82_analog_read(ANALOG_PC_IE_ADDR) |
                              bit);
        }
      else
        {
          tlsr82_analog_write(ANALOG_PC_IE_ADDR,
                              tlsr82_analog_read(ANALOG_PC_IE_ADDR) &
                              (~bit));
        }
    }
  else
    {
      if (enable)
        {
          BM_SET(GPIO_SETTING_IE_REG(group), bit);
        }
      else
        {
          BM_CLR(GPIO_SETTING_IE_REG(group), bit);
        }
    }
}

/****************************************************************************
 * Name: tlsr82_gpio_output_ctrl
 *
 * Description:
 *   Enable/Disable the gpio output function.
 *
 * Input Parameters:
 *   gpio_cfg_t - GPIO config information
 *   enable     - true : enable gpio output function
 *                false: disable gpio output function
 *
 * Returned Value:
 *   void
 *
 ****************************************************************************/

void tlsr82_gpio_output_ctrl(gpio_cfg_t cfg, bool enable)
{
  uint32_t group;
  uint32_t pin;
  uint32_t bit;

  DEBUGASSERT(GPIO_VALID(cfg));

  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);
  bit     = 1 << pin;

  if (!enable)
    {
      BM_SET(GPIO_SETTING_OEN_REG(group), bit);
    }
  else
    {
      BM_CLR(GPIO_SETTING_OEN_REG(group), bit);
    }
}

/****************************************************************************
 * Name: tlsr82_gpio_pupd_ctrl
 *
 * Description:
 *   Configure the gpio pull-up/pull-down.
 *
 * Input Parameters:
 *   gpio_cfg_t - GPIO config information
 *   pupd       - 0 : none/float
 *                1 : pull-up x100 - 1M
 *                2 : pull-down x10 - 100K
 *                3 : pull-dup x1 - 10K
 *
 * Returned Value:
 *   void
 *
 ****************************************************************************/

