apache/nuttx/arch/arm/src/tlsr82/tlsr82_gpio.c
void tlsr82_gpio_pupd_ctrl(gpio_cfg_t cfg, uint8_t pupd)
{
  uint32_t group;
  uint32_t pin;
  uint32_t basereg;
  uint32_t mask;
  uint32_t shift;

  DEBUGASSERT(GPIO_VALID(cfg));

  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);

  basereg = 0x0e + (group << 1) + ((pin >= 4) ? 1 : 0);

  shift   = (pin >= 4) ? (2 * pin - 8) : (2 * pin);
  mask    = ~(0x03 << shift);

  /* Usb dp pull-up/down config */

  if (GPIO_PIN_PA6 == GPIO_CFG2PIN(cfg))
    {
      /* usb_dp_pullup_en(0); */
    }

  tlsr82_analog_write(basereg,
                     (tlsr82_analog_read(basereg) & mask) |
                      (pupd << shift));
}

/****************************************************************************
 * Name: tlsr82_configgpio
 *
 * Description:
 *   Configure a GPIO pin based on encoded pin attributes.
 *
 ****************************************************************************/

int tlsr82_gpioconfig(gpio_cfg_t cfg)
{
  uint32_t group;
  uint32_t pin;
  uint8_t mux;
  uint8_t shift;

  /* Get the gpio group and pin */

  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);

  /* Pull-up and Pull-down config */

  if (GPIO_GET(PUPD, cfg) <= GPIO_VAL(PUPD, PU10K))
    {
      tlsr82_gpio_pupd_ctrl(cfg, GPIO_GET(PUPD, cfg));
    }

  /* Input, Output, and Mux function config */

  if (GPIO_IS(AF, INPUT, cfg))
    {
      /* IE and OEN should be set to 1 for Input usage */

      tlsr82_gpio_input_ctrl(cfg, true);
      tlsr82_gpio_output_ctrl(cfg, false);

      /* GPIO setting act as GPIO */

      BM_SET(GPIO_SETTING_ACT_REG(group), BIT(pin));
    }
  else if (GPIO_IS(AF, OUTPUT, cfg))
    {
      /* IE and OEN should be set to 0 for Output usage */

      tlsr82_gpio_input_ctrl(cfg, false);
      tlsr82_gpio_output_ctrl(cfg, true);

      /* Drive Strength config */

      tlsr82_gpio_ds_ctrl(cfg, (bool)GPIO_GET(DS, cfg));

      /* GPIO setting act as GPIO */

      BM_SET(GPIO_SETTING_ACT_REG(group), BIT(pin));
    }
  else if (GPIO_GET(AF, cfg) >= GPIO_VAL(AF, MUX0) &&
           GPIO_GET(AF, cfg) <= GPIO_VAL(AF, MUX3))
    {
      /* Clear mux first and then set mux value */

      shift = (pin >= 4) ? (2 * pin - 8) : (2 * pin);
      mux   = GPIO_GET(AF, cfg) - GPIO_VAL(AF, MUX0);

      BM_CLR(GPIO_MUX_REG(group, pin), 0x03 << shift);

      BM_SET(GPIO_MUX_REG(group, pin), mux << shift);

      /* GPIO setting act as MUX */

      BM_CLR(GPIO_SETTING_ACT_REG(group), BIT(pin));
    }

  return OK;
}

/****************************************************************************
 * Name: tlsr82_unconfiggpio
 *
 * Description:
 *   Un-configure a GPIO pin based on encoded pin attributes.
 *
 ****************************************************************************/

int tlsr82_gpiounconfig(gpio_cfg_t cfg)
{
  gpio_cfg_t pinset;

  /* Get the pin information in cfg */

  pinset = GPIO_CFG2PIN(cfg);

  /* Config gpio as input and float state */

  pinset |= GPIO_AF_INPUT | GPIO_PUPD_NONE;

  return tlsr82_gpioconfig(pinset);
}

/****************************************************************************
 * Name: tlsr82_gpiowrite
 *
 * Description:
 *   Write one or zero to the selected GPIO pin
 *
 ****************************************************************************/

void tlsr82_gpiowrite(gpio_cfg_t cfg, bool value)
{
  uint32_t group;
  uint32_t pin;

  group = (uint16_t)GPIO_GET(GROUP, cfg);
  pin   = (uint16_t)GPIO_GET(PIN, cfg);

  if (value)
    {
      BM_SET(GPIO_SETTING_OUT_REG(group), BIT(pin));
    }
  else
    {
      BM_CLR(GPIO_SETTING_OUT_REG(group), BIT(pin));
    }
}

/****************************************************************************
 * Name: tlsr82_gpioread
 *
 * Description:
 *   Read one or zero from the selected GPIO pin
 *
 ****************************************************************************/

bool tlsr82_gpioread(gpio_cfg_t cfg)
{
  uint32_t group;
  uint32_t pin;

  group = (uint32_t)GPIO_GET(GROUP, cfg);
  pin   = (uint32_t)GPIO_GET(PIN, cfg);

  if (GPIO_IS(AF, OUTPUT, cfg))
    {
      return BM_IS_SET(GPIO_SETTING_OUT_REG(group), BIT(pin)) != 0;
    }
  else
    {
      return BM_IS_SET(GPIO_SETTING_IN_REG(group), BIT(pin)) != 0;
    }
}

/****************************************************************************
 * Name: tlsr82_gpioirqinitialize
 *
 * Description:
 *   Initialize logic to support a second level of interrupt decoding for
 *   GPIO pins.
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
void tlsr82_gpioirqinitialize(void)
{
  int ret;
  int i;
  int irqs[3] =
    {
      NR_GPIO_IRQ,
      NR_GPIO_RISC0_IRQ,
      NR_GPIO_RISC1_IRQ
    };

  xcpt_t isrs[3] =
    {
      tlsr82_gpio_irq,
      tlsr82_gpio_risc0_irq,
      tlsr82_gpio_risc1_irq
    };

  for (i = 0; i < 3; i++)
    {
      /* Disable interrupt */

      up_disable_irq(irqs[i]);

      /* Attach the gpio interrupt */

      ret = irq_attach(irqs[i], isrs[i], NULL);
      if (ret == OK)
        {
          up_enable_irq(irqs[i]);
        }
      else
        {
          gpioerr("ERROR: GPIO interrupt:%d not attached!\n", irqs[i]);
        }
    }

  for (i = 0; i < CONFIG_GPIO_IRQ_MAX_NUM; i++)
    {
      gpio_irq_cbs[i].callback = NULL;
      gpio_irq_cbs[i].arg      = NULL;
      gpio_irq_cbs[i].cfg      = GPIO_INVLD_CFG;
    }
}
#endif

/****************************************************************************
 * Name: tlsr82_gpioirqconfig
 *
 * Description:
 *   Config the gpio irq according to the cfg, and attach or
 *   detach the interrupt callback function according to value of func.
 *   High Level or Rising Edge trigger, should set the pull-down resistor
 *   Low Level or Failing Edge trigger, should set the pull-up resistor
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
int tlsr82_gpioirqconfig(gpio_cfg_t cfg, xcpt_t func, void *arg)
{
  int i;
  gpio_cfg_t pinset;

  gpioinfo("cfg=0x%lx, func=0x%lx\n", cfg, (uint32_t)func);

  /* Get pin information from cfg */

  pinset = GPIO_CFG2PIN(cfg);

