apache/nuttx/arch/arm/src/tlsr82/tlsr82_gpio.c
  /* func == NULL indicates disable this interrupt */

  if (func == NULL)
    {
      /* Disable interrupt when modify the callback */

      tlsr82_gpioirqdisable_all();

      for (i = 0; i < CONFIG_GPIO_IRQ_MAX_NUM; ++i)
        {
          if (GPIO_CFG2PIN(gpio_irq_cbs[i].cfg) == pinset)
            {
              gpio_irq_cbs[i].callback = NULL;
              gpio_irq_cbs[i].arg      = NULL;
              gpio_irq_cbs[i].cfg      = GPIO_INVLD_CFG;
              break;
            }
        }

      /* Disable corresponding pin interrupt */

      tlsr82_gpioirqdisable(cfg);
    }
  else
    {
      /* Find an appropriate callback object */

      for (i = 0; i < CONFIG_GPIO_IRQ_MAX_NUM; ++i)
        {
          if (GPIO_CFG2PIN(gpio_irq_cbs[i].cfg) == pinset ||
              gpio_irq_cbs[i].callback == NULL)
            {
              /* 1. Re-config the same pin before unconfig it, just direct
               *    use previous callback object.
               * 2. New pinset, use a new callback object.
               */

              break;
            }
        }

      if (i == CONFIG_GPIO_IRQ_MAX_NUM)
        {
          /* Callback objects have been ran out */

          gpioerr("Config Fail, gpio_irq_cbs[] have been ran out.\n");
          return -ENOSPC;
        }

      /* Disable interrupt when modify the callback */

      tlsr82_gpioirqdisable_all();

      /* Find callback object success */

      gpio_irq_cbs[i].callback = func;
      gpio_irq_cbs[i].arg      = arg;
      gpio_irq_cbs[i].cfg      = cfg;

      /* Enable corresponding pin interrupt */

      tlsr82_gpioirqenable(cfg);
    }

  /* Configure the gpio */

  tlsr82_gpioconfig(cfg);

  /* Config gpio interrupt polarity */

  tlsr82_gpio_pol_ctrl(cfg, GPIO_GET(POL, cfg));

  /* Clear the interrupt flag */

  tlsr82_gpioirqclear(cfg);

  /* Enable corresponding gpio interrupt */

  tlsr82_gpioirqenable_all();

  /* Dump the gpio register for debug */

  tlsr82_gpio_dumpregs("tlsr82_gpioirqconfig()");

  return OK;
}
#endif

/****************************************************************************
 * Name: tlsr82_gpioirqenable
 *
 * Description:
 *   Enable the interrupt for specified GPIO IRQ
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
void tlsr82_gpioirqenable(gpio_cfg_t cfg)
{
  uint32_t group;
  uint32_t pin;
  uint32_t irqmode;

  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);
  irqmode = (uint32_t)GPIO_GET(IRQ, cfg);

  /* Enable corresponding gpio interrupt */

  if (irqmode == GPIO_IRQ_NORMAL_VAL)
    {
      /* Enable corresponding pin interrupt, irq */

      BM_SET(GPIO_IRQ_NORMAL_REG(group), BIT(pin));

      /* Enable the total gpio interrupt */

      BM_SET(GPIO_IRQ_NORMAL_ALL_REG, GPIO_IRQ_NORMAL_ALL_EN);
    }
  else if (irqmode == GPIO_IRQ_M0_VAL)
    {
      /* Set M0, the timer interrupt is controlled by timer */

      BM_SET(GPIO_IRQ_M0_REG(group), BIT(pin));
    }
  else if (irqmode == GPIO_IRQ_M1_VAL)
    {
      /* Set M1, the timer interrupt is controlled by timer */

      BM_SET(GPIO_IRQ_M1_REG(group), BIT(pin));
    }
  else if (irqmode == GPIO_IRQ_M2_VAL)
    {
      /* Set M2, the timer interrupt is controlled by timer */

      BM_SET(GPIO_IRQ_M2_REG(group), BIT(pin));
    }
  else if (irqmode == GPIO_IRQ_RISC0_VAL)
    {
      /* Set M0, enable risc0 bit, enable gpio risc0 interrupt */

      BM_SET(GPIO_IRQ_M0_REG(group), BIT(pin));
      BM_SET(GPIO_IRQ_RISC_EN_REG, GPIO_IRQ_RISC0_EN);
    }
  else if (irqmode == GPIO_IRQ_RISC1_VAL)
    {
      /* Set M1, enable risc1 bit, enable gpio risc1 interrupt */

      BM_SET(GPIO_IRQ_M1_REG(group), BIT(pin));
      BM_SET(GPIO_IRQ_RISC_EN_REG, GPIO_IRQ_RISC1_EN);
    }
  else
    {
      gpioerr("GPIO irq type is not correct, cfg=0x%lx\n", cfg);
    }
}

#endif

/****************************************************************************
 * Name: tlsr82_gpioirqdisable
 *
 * Description:
 *   Disable the interrupt for specified GPIO IRQ
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
void tlsr82_gpioirqdisable(gpio_cfg_t cfg)
{
  uint32_t group;
  uint32_t pin;
  uint32_t irqmode;

  group   = (uint32_t)GPIO_GET(GROUP, cfg);
  pin     = (uint32_t)GPIO_GET(PIN, cfg);
  irqmode = (uint32_t)GPIO_GET(IRQ, cfg);

  if (irqmode == GPIO_IRQ_NORMAL_VAL)
    {
      BM_CLR(GPIO_IRQ_NORMAL_REG(group), BIT(pin));
    }
  else if (irqmode == GPIO_IRQ_M0_VAL)
    {
      BM_CLR(GPIO_IRQ_M0_REG(group), BIT(pin));
    }
  else if (irqmode == GPIO_IRQ_M1_VAL)
    {
      BM_CLR(GPIO_IRQ_M1_REG(group), BIT(pin));
    }
  else if (irqmode == GPIO_IRQ_M2_VAL)
    {
      BM_CLR(GPIO_IRQ_M2_REG(group), BIT(pin));
    }
  else if (irqmode == GPIO_IRQ_RISC0_VAL)
    {
      BM_CLR(GPIO_IRQ_M0_REG(group), BIT(pin));
      BM_CLR(GPIO_IRQ_RISC_EN_REG, GPIO_IRQ_RISC0_EN);
    }
  else if (irqmode == GPIO_IRQ_RISC1_VAL)
    {
      BM_CLR(GPIO_IRQ_M1_REG(group), BIT(pin));
      BM_CLR(GPIO_IRQ_RISC_EN_REG, GPIO_IRQ_RISC1_EN);
    }
  else
    {
      gpioerr("GPIO irq type is not correct, cfg=0x%lx\n", cfg);
    }
}

#endif

/****************************************************************************
 * Name: tlsr82_gpioirqclear
 *
 * Description:
 *   Clear the interrupt flag for specified GPIO IRQ
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
void tlsr82_gpioirqclear(gpio_cfg_t cfg)
{
  uint32_t irqmode;

  irqmode = (uint32_t)GPIO_GET(IRQ, cfg);

  /* Clear corresponding gpio interrupt flag */

  if (irqmode == GPIO_IRQ_NORMAL_VAL)
    {
      BM_SET(IRQ_SRC_REG, BIT(NR_GPIO_IRQ));
    }
  else if (irqmode == GPIO_IRQ_RISC0_VAL)
    {
      BM_SET(IRQ_SRC_REG, BIT(NR_GPIO_RISC0_IRQ));
    }
  else if (irqmode == GPIO_IRQ_RISC1_VAL)
    {
      BM_SET(IRQ_SRC_REG, BIT(NR_GPIO_RISC1_IRQ));
    }
  else
    {
      gpioerr("GPIO irq type is not correct, cfg=0x%lx\n", cfg);
    }
}

#endif

/****************************************************************************
 * Name: tlsr82_gpioirqdisable_all
 *
 * Description:
 *   Disable all the gpio interrupt (not clear gpio pin corresponding
 *   interrupt bit.)
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
void tlsr82_gpioirqdisable_all(void)
{
  up_disable_irq(NR_GPIO_IRQ);
  up_disable_irq(NR_GPIO_RISC0_IRQ);
  up_disable_irq(NR_GPIO_RISC1_IRQ);
}
#endif

/****************************************************************************
 * Name: tlsr82_gpioirqenable_all
 *
 * Description:
 *   Enable all the gpio interrupt (not set gpio pin corresponding
 *   interrupt bit.)
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_GPIO_IRQ
void tlsr82_gpioirqenable_all(void)
{
  up_enable_irq(NR_GPIO_IRQ);
  up_enable_irq(NR_GPIO_RISC0_IRQ);
  up_enable_irq(NR_GPIO_RISC1_IRQ);
}
#endif
